app/Http/Controllers/Api/AuthController.php

select * from `users` where `no_thl` = '99' limit 1
---
    public function login(Request $request)
    {
        /**
         * key login

         NO THL,
         PASSWORD

         */
        $credentials = $request->only('no_thl', 'password');

        try {
            if (!$token = JWTAuth::attempt($credentials)) {
                return response()->json(['error' => 'invalid_credentials', "value"    => 0,], 400);
            }
        } catch (JWTException $e) {
            return response()->json(['error' => 'could_not_create_token'], 500);
        }

        $user = User::where("no_thl", $request->no_thl)->first();