app/Http/Controllers/Api/PresensiController.php

    public function store(Request $request)
    {

        /**
         *       KEY KEY
                    "image"     => $name,
                    "latitude"  => $request->latitude,
                    "longtitude"=> $request->longtitude,
                    "lokasi"    => $request->lokasi,
                    "user_id"   => Auth::user()->id
         */

        $jam_mulai  = Jadwal::where("nama_lain", date("l"))->pluck("jam_mulai")->first();
        $jam_selesai = Jadwal::where("nama_lain", date("l"))->pluck("jam_selesai")->first();

        $current_time   = date("H:i:s");
        $sunrise        = $jam_mulai;
        $sunset         = $jam_selesai;
        $date1 = DateTime::createFromFormat('H:i:s', $current_time);
        $date2 = DateTime::createFromFormat('H:i:s', $sunrise);
        $date3 = DateTime::createFromFormat('H:i:s', $sunset);

        if ($date1 > $date2 && $date1 < $date3) {
            /**
             * kode 0 untuk jam kerja asli
             * kode 1 untuk jam kerja lembur
             */

            $place = Place::where("user_id", Auth::user()->id)
                ->whereDay("time", date("d"))
                ->where("status", "=", 0)
                ->first();
---
select `jam_mulai` from `jadwals` where `nama_lain` = 'Thursday'
select `jam_selesai` from `jadwals` where `nama_lain` = 'Thursday'
select * from `places` where `user_id` = 1 and day(`time`) = '26' and `status` = 0 limit 1