app/Http/Controllers/KehadiranController.php

select * from `users` where `role` = 1
select * from `users` where (`role` = 1 and `jabatan` = '1')
---
    public function index(Request $request)
    {
        $mulai      = urlencode($request->mulai);
        $selesai    = urlencode($request->selesai);
        $waktu      = urlencode($request->waktu);

        $tugas = User::where("role", "=", 1)->get();

        if(!empty($mulai) && !empty($selesai) && !empty($waktu)){
            switch ($request->input("action")) {
                case 'cari':
                    if ($waktu == "pagi"){
                        $user = User::with(["kehadirans" => function($query) use($mulai, $selesai, $waktu){
                            $query->whereBetween("time", [date($mulai." ". "00:00:00"), date($selesai. " "."23:59:59")])->where("status", 0 );
                        }])->where([
                            ["role", 1],
                            ["jabatan", $request->tugas]
                                ])->get();

select * from `users` where (`role` = 1 and `jabatan` = 'TENAGA KEBERSIHAN')
---
                case 'cetak':
                    if ($waktu == "pagi"){
                        $waktu = "Pagi";
                        $data = User::with(["kehadirans" => function($query) use($mulai, $selesai, $waktu){
                            $query->whereBetween("time", [date($mulai." ". "00:00:00"), date($selesai. " "."23:59:59")])->where("status", 0);
                        }])->where([
                            ["role", 1],
                            ["jabatan", $request->tugas]
                                ])->get();

select * from `users` where `role` = 1
---
            $mulai      = date('Y-m-d 00:00:00');
            $selesai    = date('Y-m-d 23:59:59');

            $user = User::with(["kehadirans" => function($query) use($mulai, $selesai){
                $query->whereBetween("time", [date($mulai), date($selesai)])->where("status", 0 );
            }])->where("role", 1)->get();

select * from `places`
select * from `users` where `users`.`id` in (3, 4, 5)
---
    public function terkini_json()
    {
        $places = Place::with("user")->get();

select * from `places` where `id` = '12' limit 1
select * from `users` where `users`.`id` in (5)
select min(`id`) as aggregate from `places` where `id` > 12
---
    public function terkini_id($id)
    {
        $kehadiran = Place::with("user")->where("id", $id)->first();

        if(empty($kehadiran)) abort(404);

        $previous = Place::where("id", "<", $kehadiran->id)->max("id");